//  Задача 1. Написать программу, которая запрашивает у пользователя его имя и возраст (в годах)
// и выводит в консоль сообщение ‘Hello, <name>’, если пользователь совершеннолетний, 
// или ‘Hi, <name>’, если пользователь несовершеннолетний.

// const UserName = prompt ( 'ввидите Имя');
// const UserAge = +prompt ( 'ввидите Возраст');
// if (UserAge > 18)
// {
//     console.log ('Hello, ' + UserName + '');}
// if (UserAge < 18) 
// {
// console.log ('Hi, ' + UserName + '');}

// Задача 2.Написать программу, которая считывает через prompt число 
// и выводит одно из следующих сообщений: ‘Число меньше 100’, ‘Число больше 100’ или ‘Число равно 100’


//  const numbers = +prompt ('Ввидите число');
//  for(let i = 0; i - numbers; i++ ){
//  if (i > 100) {
//         console.log("Число больше 100");
//     } else if (i < 100) {
//         console.log("Число меньше 100");
//     } else {
//         console.log("Число равно 100");
//     }
// }
 
// Задача 3. Написать программу, которая получает два числа и выводит наименьшее



// const numbers1 = +prompt ('Ввидите число1');
// const numbers2 = +prompt ('Ввидите число2');
// if  (numbers1 < numbers2)
// {
// console.log ( numbers1 )
// }
// if (numbers2 < numbers1)
// {
//     console.log ( numbers2 )
// }

//Написать программу, которая через prompt считывает число и выводит в консоль 
//число равное 10% от введенного числа

// const num = +prompt ( 'chislo');
// {
//     console.log (  num*0.1 )
// }

 


  
    
    





